Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys.h
			注意：采集温度通道返回的是ADC的原始值，用 float Get_Temprate(u32 adcx) 把原始值转换为实际温度值(float类型)
	*/
		
#define SYSTEM_IWDG_ENABLE		1			/*开启独立看门狗，默认1S的喂狗周期，默认在TIM4定时中断里喂狗，用IWDG必开TIM4*/
											/*注：看门狗和低功耗待机模式不能同时开启，因为看门狗不能关闭，看门狗复位会唤醒低功耗状态*/

/*开启串口，x8/xB系列有三个串口，最好不超过2M位每秒。默认均为：8位数据，1位停止，无校验，收发模式，开启接受中断*/
/*串口方面可用API，看SYSTEM_SUPPORT_sprintf宏定义的注释*/
/*注：串口2、3的接收回调函数没有补全，用时再补，和串口1的同理*/
#define SYSTEM_UART1_ENABLE			1		/*使能串口1	       TX/PA9, RX/PA10		*/
#define SYSTEM_UART1_REMAP_ENABLE	0		/*串口1引脚重映射：TX/PB6, RX/PB7		*/
#define SYSTEM_UART1_BOUND			115200	/*串口1波特率*/

/*注：串口2在目前不能用，没有反应，不知道是HAL库问题还是芯片问题*/
#define SYSTEM_UART2_ENABLE			0		/*使能串口2	       TX/PA2, RX/PA3		*/
#define SYSTEM_UART2_REMAP_ENABLE	0		/*串口2引脚重映射：TX/PD5, RX/PD6，可以设置，但对于C8T6无此引脚*/
#define SYSTEM_UART2_BOUND			115200	/*串口2波特率*/

#define SYSTEM_UART3_ENABLE			0		/*使能串口3	       TX/PB10, RX/PB11		*/
#define SYSTEM_UART3_REMAP_ENABLE	0		/*串口3引脚重映射：TX/PD8,  RX/PD9，可以设置，但对于C8T6无此引脚*/
#define SYSTEM_UART3_BOUND			115200	/*串口3波特率*/
/*可用的API： 目前串口接收的问题就是一次涌入数据过多会崩，可能是存储数据时栈溢出，但是暂时找不到在哪里，小数据量接收没大问题
	发送：	如果启用 SYSTEM_SUPPORT_sprintf ，则可用：不要用printf！
				参数：UART1~UART3
				printf_uart(UART1,"Fault : %d\t",x);
				也可以用	sprintf(char* buffer, const char* format, ...); 				不带字节数量限制
							snprintf(char* buffer, size_t count, const char* format, ...); 	带字节数量限制，更安全
			如果没有启用 SYSTEM_SUPPORT_sprintf ，则可用以下：
			参数：UART1_Handler~UART3_Handler ， 发送数据的字符类型指针 ， 数据长度(字节数} ， 超时时间
				HAL_UART_Transmit(&UART1_Handler,UART_BUF,12,10); 				发送函数
				while(__HAL_UART_GET_FLAG(&UART1_Handler,UART_FLAG_TC)!=SET); 	等待发送结束
	接收：（以下只针对串口1说明）（一次接收字符不要超过200个字节，如果超出则丢弃之后的数据）
			接受协议设置(默认协议0)：USART1_SetMode(0);	串口1接受协议：0为只接受以'\r\n'结尾的数据（数据以去掉\r\n保存），1为以FIFO先进先出的环形缓存实现接受区，数据原样保存，无协议
				接受协议设置可用随时切换，切换后接收方式也随下面的说明换。
			统一接收函数： 返回returnOK即有数据可以取，反之为ReturnErr；is_print：是否打印接收到的数据；buf用于存放接收到的数据，必须先给个足够大的容器
							char sys_USART1_RX_Fetch(u8 is_print, char* buf)
							用例：
								char buf4uart1[(USART1_RX_BUF_MaxNum > USART1_RX_FIFO_MaxNum) ? (USART1_RX_BUF_MaxNum):(USART1_RX_FIFO_MaxNum)];
								if(sys_USART1_RX_Fetch(FALSE, buf4uart1) == ReturnOK)
								{
									printf_uart(UART1,"%s-",buf4uart1);
									printf_uart(UART1,"%d",mystrlen(buf4uart1));
								}
			以下两个是协议0、1的接收细节，已经在sys_USART1_RX_Fetch()内实现，一般不用看
			协议0：
				接受区缓存大小设置：#define USART1_RX_BUF_MaxNum 200 这个语句在下面串口宏定义区里面
				判断是否接收完成一次：USART1_isDone		用于判断是否接受完成一次 例子： if(USART1_isDone){表示接收完成一次}
				查询本次接收完成一次后接收到的字符数量：USART1_RX_ByteNum u8类型 不包含"\r\n"两个字符！
				接收缓存区：	USART1_RX_BUF[x] ，x : 0~USART1_RX_ByteNum
				接受成功一次之后，处理完数据之后，清接收完成标志：USART1_SetUnDone;
			协议1：
				以FIFO储存区接收保存数据，FIFO初始化函数在sys.c里面的串口初始化函数中
				接受区缓存大小设置：#define USART1_RX_FIFO_MaxNum 200 这个语句在下面串口宏定义区里面
				while (!fifo_is_empty(Uart1_fifo))
				{
					char/int/float/struct... fifodata;
					fifo_get(Uart1_fifo, &fifodata);	//fifodata可以为各种字符型、整形、浮点型、结构体型等等
					printf_uart(UART1,"%c",fifodata); 
				}
				由于没有协议，只是储存，所以没有接收完成标志
				
*/

/*开启硬件SPI，x8/xB系列有两个SPI，最高18M位每秒
默认：尽量只用其中一个，多个器件用多个SS使能端，不提供引脚重映射，默认一次发送八位bits数据，SS引脚用户单独定义！
		master模式，MSB First，SS低电平选中器件
		SCK空闲时刻为高电平(时钟极性CPOL=1)（默认）：
			若使用第二跳变沿数据被采样(时钟相位CPHA=1)：数据线在 SCK 的偶数边沿采样（默认）
			若使用第一跳变沿数据被采样(时钟相位CPHA=0)：数据线在 SCK 的奇数边沿采样
引脚：
	SPI1->CS	SPI1->CLK	SPI1->MISO	SPI1->MOSI 	—————— 	SPI2->CS	SPI2->CLK	SPI2->MISO	SPI2->MOSI
	PA4			PA5			PA6			PA7					PB12		PB13		PB14		PB15
*/
#define SYSTEM_SPI1_ENABLE		0		/*使能SPI1*/
#define SYSTEM_SPI2_ENABLE		0		/*使能SPI2*/
/*提供API：
	用户自定SS引脚：
		到PeriphConfig.c里面的
			sys_SPI1_SS_io_Init();		自行更改
			sys_SPI2_SS_io_Init();		自行更改
		以及 到PeriphConfig.h里面的
			#define	SPI1_CS PAout(4)	自行更改
			#define	SPI2_CS PBout(12)	自行更改
	写读函数：(目前只写了SPI1，SPI2如果要用的话同理)
		u8 SPI1_ReadWriteByte_8Byte(u8 TxData) 		读写一个字节
		u8 SPI1_ReadWriteByte_16Byte(u8* TxData) 	连写两个字节并读回，传入一个包含2字节的u8*指针
		u8 SPI1_WriteByte_8Byte(u8 TxData)			写一个字节
		u8 SPI1_WriteByte_16Byte(u8* TxData)		连写两个字节，传入一个包含2字节的u8*指针
		例子：
			u8 Max7219_adr_data[Max7219_regNum][2] = 
			{
				{0x09,0xFF},
				{0x0A,0x08},
				...
			}
			for(i = 0;i < Max7219_regNum;i++)
				SPI1_WriteByte_16Byte(Max7219_adr_data[i]);
	
	设置SPI速度函数： APB2为72MHz，APB1为二分频为36Mhz
		void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler);	//SPI1由APB2分频得来
		void SPI2_SetSpeed(u8 SPI_BaudRatePrescaler);	//SPI2由APB1分频得来
*/

/*低功耗模式：
睡眠： WFI操作进入，任意中断恢复，CPU时钟关，其他外设时钟维持																		（不可用）
停止：HSI、HSE时钟关，电压调节器开关需设置，任一外部中断唤醒，典型电流值为20uA														（不可用）
待机：HSI、HSE时钟关，电压调节器关，SRAM和寄存器内容丢失，仅电源控制寄存器和备份区域不受影响
		唤醒条件：WKUP按键上升沿，RTC警告事件，复位按键，看门狗复位（！），典型电流值为2uA，为三个模式中最低 	类似于开关机		（可用）
		WKUP 在PA0
*/
#define SYSTEM_StdbyWKUP_ENABLE	0		/*使用待机-低功耗模式（占用0线外部中断）*/
										/*注：看门狗和低功耗待机模式不能同时开启，因为看门狗不能关闭，看门狗复位会唤醒低功耗状态*/
/*当启用 SYSTEM_StdbyWKUP_ENABLE 后，PA0作为WKUP按键，默认长按3秒进入待机状态，再次按下则恢复，进入待机模式函数在PA0的外部中断里*/
//对于PA0，按下为高电平，按下3s后松开，延时一秒（给时间做保存数据等关机前的准备）后进入待机状态（关机），再次按下开机
/*WKUP IO不用外接下拉电阻，在配置时STM32内部已经上拉*/

/*不同容量的FLASH组织方式：
小容量：32个	1K字节/页
中容量：128个	1K字节/页
大容量：256个	2K字节/页
*/
#define SYSTEM_FLASH_IAP_ENABLE	0		/*启用对内部FLASH储存空间编程*/
	#define STM32_FLASH_WREN	1		/*启用写功能，否则只读不写*/
	#define STM32_FLASH_SIZE 	64 		/*所选STM32的FLASH容量大小(单位为KB)*/
	#define FLASH_SAVE_ADDR  0X0800F000					//设置FLASH 保存地址(必须为页的首地址！且其值要大于本代码所占用FLASH的大小+0X08000000)
	#define FLASH_SAVE_ADDR1 (0X08000000 + (u32)(60*1024))
/*可用API：
	注：当启用本功能后，在系统初始化序列中将加入读存开机次数的一个用例，一个u16的变量会储存在最后一个或倒数第二个页
	例：	const u8 TEXT_Buffer[]={"STM32F103 FLASH TEST"};	//用于存入的数据
			u8 datatemp[sizeof(TEXT_Buffer)];					//用于接读出的数据
	写：(一次写入长度最多为一个页的字节数，对于中小容量的为1KB，对于大容量的为2KB！)
		STMFLASH_Write(	FLASH_SAVE_ADDR1,	(u16*)TEXT_Buffer,	sizeof(TEXT_Buffer));
	读：STMFLASH_Read(	FLASH_SAVE_ADDR1,	(u16*)datatemp,		sizeof(TEXT_Buffer));
*/

/*hd系列外设，DAC两个输出通道 PA4和PA5，默认初始化为12位右对齐，速度最快为250K左右，输出范围 0~Vref+，默认Vref+为3.3V，否则自行更改转换计算*/
/*可选输出 噪声波形 和 三角波波形 ，默认不适用外部触发，可选触发源在初始化函数中修改（有定时器中断和外部中断线9）*/
#define SYSTEM_DAC_OUT1_ENABLE	0
#define SYSTEM_DAC_OUT2_ENABLE	0
/*可用API:
	设置通道1输出电压,vol:0~3.30V
		void DAC_Set_Ch1_Vol(float vol)
	设置通道2输出电压,vol:0~3.30V
		void DAC_Set_Ch2_Vol(float vol)
*/

/*hd系类外设，六根线（四位数据线，时钟线和命令线），SDIO最高传输速度12M字节每秒，目前只支持用于SD卡*/
/*支持的四种卡：SD2.0 高容量卡（SDHC，最大32G），SD2.0 标准容量卡（SDSC，最大 2G），SD1.x 卡和 MMC 卡）*/
/*
初始化后获取到的卡信息存在：
	HAL_SD_CardInfoTypeDef  SDCardInfo;	//SD卡信息结构体
	成员：
		uint32_t CardType;             			卡类型：						Specifies the card Type
														CARD_SDSC					SD Standard Capacity
														CARD_SDHC_SDXC				SD High Capacity <32Go, SD Extended Capacity <2To
														CARD_SECURED
		uint32_t CardVersion;                 	卡版本：CARD_V1_X、CARD_V2_X	Specifies the card version
		uint32_t Class;                        	卡级别							Specifies the class of the card class 
		uint32_t RelCardAdd;                  	卡相对地址						Specifies the Relative Card Address
		uint32_t BlockNbr;                     	块数量							Specifies the Card Capacity in blocks
		uint32_t BlockSize;                   	块大小							Specifies one block size in bytes
		uint32_t LogBlockNbr;                 	逻辑块数量						Specifies the Card logical Capacity in blocks
		uint32_t LogBlockSize;                	逻辑块大小（一般为512字节一块）	Specifies logical block size in bytes
	
